In [1]:
import pandas as pd
import numpy as np

d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [2]:
df = pd.DataFrame(d) # use caps...

In [3]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [4]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [5]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

AttributeError: type object 'object' has no attribute 'dtype'

In [6]:
d = {'one': [1., 2., 3., 4.],
         'two': [4., 3., 2., 1.]}

In [7]:
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [8]:
pd.DataFrame(d, index=["a","b","c","d"]) # change index names

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [9]:
# or from a series
pd.DataFrame(pd.Series(np.random.randn(5), name='something'))

   something
0   0.036748
1  -1.863572
2   0.053476
3   0.703136
4   1.511806

In [10]:
df["one"]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [11]:
df["three"] = df["one"] * df["two"]
df

   one  two  three
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

In [12]:
# del df["two"] # I ran it twice, so two doesn't exist anymore lol

In [13]:
df

   one  two  three
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

In [14]:
df["foo"] = "bar" # add a column easily
df

   one  two  three  foo
a  1.0  1.0    1.0  bar
b  2.0  2.0    4.0  bar
c  3.0  3.0    9.0  bar
d  NaN  4.0    NaN  bar

In [15]:
df["one_trunc"] = df["one"][:2] # copying up to an index...
df

   one  two  three  foo  one_trunc
a  1.0  1.0    1.0  bar        1.0
b  2.0  2.0    4.0  bar        2.0
c  3.0  3.0    9.0  bar        NaN
d  NaN  4.0    NaN  bar        NaN

In [20]:
# new df!
df = pd.DataFrame(np.random.randn(8, 3), columns=list('ABC'))

In [21]:
df * 5 + 2

           A         B         C
0  13.191685  2.318313 -0.059552
1   8.289997 -3.118108 -0.554816
2  -1.564951  0.312649 -1.871189
3   0.448597 -5.282956 -5.347355
4   5.565190  0.494617 -3.131885
5   4.885391  2.720827  1.786362
6  -0.202690 -2.251374 -2.996612
7   4.166304 -0.500665  6.759551

In [ ]:
1 / df

In [ ]:
df ** 4

In [ ]:
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)

In [ ]:
df1 & df2

In [ ]:
df1 | df2

In [ ]:
df1 ^ df2

In [ ]:
-df1